linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/sendMessage.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.sendmessage">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:appUri>https://api.linkedin.com/v1</urn:appUri>
      <urn:accessToken>AQWE6N2hAjyHx9LIS6UU_0AktUN9aNN0ZFyIkUNYpSe10Vj559ppL4wur2QBOdCSOLBI3P2MEjHjV-Pz93xrZte3e2XfgrzkB30N5-twK9exifpuucMA5ZgvL7n2bpOx7dFxHfGM2eRfaoao0hKdSW1hnjL7i3GbrCeyrKhUZGECbv7agC4</urn:accessToken>
      <urn:subject>Hi</urn:subject>
      <urn:messageBody>Hello</urn:messageBody>
      <urn:recipients><recipient><person path="/people/~"/></recipient><recipient><person path="/people/abcdefg"/></recipient></urn:recipients>
   </soapenv:Body>
</soapenv:Envelope>